{"pageProps":{"mobile":{"_createdAt":"2023-03-13T02:50:46Z","_id":"fa41895b-5dd6-4993-a763-7c1b63a309b0","_rev":"Z19WD5Iu14x5pOZe0fTimi","_type":"mobile","_updatedAt":"2023-03-23T06:47:20Z","brand":"CG MOBILE","category":"Accessories","color":"Black","fulldesc":["ELEGANT AND SLIM CELL PHONE CASE: CG Mobile has created this form-fitting. This case is designed for ease of use while protecting your investment. It protects your iPhone in luxurious style, which gives you a classic and elegant appeal to your handheld device. It also offers a slim ergonomic design and high-quality grip.","PROTECT YOUR SMARTPHONE IN STYLE: Directly inspired by both Mercedes-Benz interiors and exteriors, this iPhone case features a debossed Mercedes-Benz wordmark, as well as an embossed line and encrusted metal Mercedes-Benz logo accent. Mercedes-Benz is known and recognized for its elegant designs and flawless finishes. CG Mobile allows you to take that elegance with you wherever you go.","ULTIMATE PROTECTION FOR YOUR INVESTMENT: These iPhone 13 Series cases feature slightly raised edges for drop protection and scratch resistance. Keep your mobile phone protected against impact at all times. Easy snap-on feature with raised screen edge that keeps your screen and camera protected.","PRECISION AND EASY ACCESS: Precise cutouts allow complete and easy access for all ports, cameras, buttons, and speakers."],"image":[{"_key":"a91b20cda472","_type":"image","asset":{"_ref":"image-0209b9594ce0c7c32d4924a3b5a1a4d2d30ff150-500x500-jpg","_type":"reference"}},{"_key":"db1b593f397c","_type":"image","asset":{"_ref":"image-df82c452199ae2df793e00731b82d138ac090dc7-500x500-jpg","_type":"reference"}}],"mrp":2997,"name":"CG MOBILE TPU, PC Silver Electroplated Hard and Shock Absorption Protective Cover for iPhone 13 6.1-inches, 2021 (Transparent, Black)","os":"ios","saleprice":1399,"shortdesc":"CG MOBILE TPU, PC Silver Electroplated Hard and Shock Absorption Protective Cover for iPhone 13 6.1-inches, 2021 (Transparent, Black)","size":6.1,"slug":{"_type":"slug","current":"cg-mobile-tpu-pc-silver-electroplated-hard-and-shock-absorption-protective-cover-for-iphone-13-6-1-inches-2021-transparent-black"},"subcategory":"Cover","tags":["mobiles","accessories","cover ","cg mobiles"]}},"__N_SSG":true}